public/nav.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-16 Tue 17:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Navigations</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Navigations</h1>
<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Virgo</a></td>
<td class="org-left"><a href="http://fanyi.youdao.com/">有道翻译</a></td>
<td class="org-left"><a href="http://www.fhdq.net/">符号大全</a></td>
<td class="org-left"><a href="https://emacs-china.org/">Emacs China</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/loveminimal">Github</a></td>
<td class="org-left"><a href="https://www.bilibili.com/">Bilibili</a></td>
<td class="org-left"><a href="https://www.youtube.com/">YouTube</a></td>
<td class="org-left"><a href="https://www.meijutt.tv/">天天美剧</a></td>
<td class="org-left"><a href="https://www.gushiwen.org/">古诗文网</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.crx4chrome.com/">Crx4Chrome</a></td>
<td class="org-left"><a href="https://www.zhihu.com/">知乎</a></td>
<td class="org-left"><a href="https://cloud.tencent.com/developer/labs">腾讯云</a></td>
<td class="org-left"><a href="https://cloud.huawei.com/home#/notepad/task/2f0739e3$ee3c$4049$8422$461c7e46d116/none">华为云</a></td>
<td class="org-left"><a href="http://www.etymon.cn/index.html">英语字根</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://www.cnpctest.com/rcyy900.htm">英语日常用语</a></td>
<td class="org-left"><a href="http://www.yinwang.org/">当然我在扯淡</a></td>
<td class="org-left"><a href="https://manateelazycat.github.io/index.html">ManateeLazyCat</a></td>
<td class="org-left"><a href="https://www.liaoxuefeng.com/">廖雪峰</a></td>
<td class="org-left"><a href="http://www.ruanyifeng.com/blog/developer/">阮一峰</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://xahlee.org/">李杀网</a></td>
<td class="org-left"><a href="https://objcoding.com/">后端进阶</a></td>
<td class="org-left"><a href="http://smacs.github.io/">水木社区 Emacs</a></td>
<td class="org-left"><a href="http://mashibing.com/">马士兵</a></td>
<td class="org-left"><a href="https://coolshell.cn/">酷壳</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://blog.udn.com/MengyuanWang/article">王孟源的部落格</a></td>
<td class="org-left"><a href="https://code2048.com/">神秘的程序员们</a></td>
<td class="org-left"><a href="https://www.cnblogs.com/TomXu/archive/2011/12/15/2288411.html">汤姆大叔的博客</a></td>
<td class="org-left"><a href="http://www.lining0806.com/">宁哥的小站</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://bitsofco.de/">Bitsofco</a></td>
<td class="org-left"><a href="http://es6.ruanyifeng.com/">ES6 RYF</a></td>
<td class="org-left"><a href="http://www.runoob.com/">菜鸟教程</a></td>
<td class="org-left"><a href="https://man.linuxde.net/">Linux 命令大全</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.softwhy.com/">蚂蚁部落</a></td>
<td class="org-left"><a href="http://www.bootcss.com/">BootCSS</a></td>
<td class="org-left"><a href="https://www.bootcdn.cn/">BootCDN</a></td>
<td class="org-left"><a href="https://www.interviewcake.com/data-structures-reference">Interview Cake</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://learnxinyminutes.com/">Learn X in Y</a></td>
<td class="org-left"><a href="https://cn.vuejs.org/index.html">Vue Doc</a></td>
<td class="org-left"><a href="https://element.eleme.cn/#/zh-CN/component/installation">ElementUI</a></td>
<td class="org-left"><a href="https://www.antdv.com/docs/vue/introduce-cn/">Ant Design Vue</a></td>
<td class="org-left"><a href="https://www.kancloud.cn/yunye/axios/234845">Axios</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://mockjs.com/examples.html">MockJS</a></td>
<td class="org-left"><a href="http://docs.form.xiaoyaoji.cn/">FormMaking</a></td>
<td class="org-left"><a href="https://www.bejson.com/ui/compress_img/">图压缩</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://daneden.github.io/animate.css/">AnimateCSS</a></td>
<td class="org-left"><a href="https://fontawesome.com/">FontAwesome</a></td>
<td class="org-left"><a href="http://www.iconfont.cn/">iconfont</a></td>
<td class="org-left"><a href="http://www.melpa.org/#/">Melpa</a></td>
<td class="org-left"><a href="https://vimawesome.com/">VimAwesome</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://chocolatey.org/packages">Chocolatey</a></td>
<td class="org-left"><a href="http://tool.c7sky.com/webcolor/">Web Color</a></td>
<td class="org-left"><a href="https://pixabay.com/zh/">Pixabay</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.fonts.net.cn/">字体之家</a></td>
<td class="org-left"><a href="http://www.musictool.top/">音乐聚合</a></td>
<td class="org-left"><a href="https://theoldreader.com/">RSS</a></td>
<td class="org-left"><a href="http://www.nginx.cn/doc/">Nginx Doc</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="http://doc.norang.ca/org-mode.html">Org Mode Plain</a></td>
<td class="org-left"><a href="https://geekinney.com/">Geenkinney</a></td>
<td class="org-left"><a href="https://blog.yiyuemo.com/">AngelDevil</a></td>
<td class="org-left"><a href="https://www.lijigang.com/">LiJigang</a></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b>Bookmarks InboX</b>
</p>

<ul class="org-ul">
<li><b>合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。</b></li>
<li><a href="https://www.jianshu.com/p/c894ea00dfec">使用require.context实现前端工程自动化</a></li>
<li><a href="https://www.cnblogs.com/kainhuck/p/11608966.html">archlinux下安装mysql</a></li>
<li><a href="https://juejin.im/post/5b8905456fb9a01a105966b4">彻底搞懂word-break、word-wrap、white-space</a></li>
<li><a href="https://www.jianshu.com/p/2a3728cded4c?utm_campaign=maleskine&amp;utm_content=note&amp;utm_medium=reader_share&amp;utm_source=weixin">JavaScript 中如何实现深度克隆</a></li>
<li><a href="https://segmentfault.com/a/1190000011882933">简单说通过 CSS 实现文字渐变色的两种方式</a></li>
<li><a href="https://kuanyui.github.io/2016/02/24/dynamic-scoping-and-lexical-scoping/">搞懂 Lexical scoping 與 Dynamic scoping 的差異與用途</a></li>
<li><a href="https://www.zhangxinxu.com/wordpress/2010/01/css3-border-image">CSS3 border-image详解、应用及jQuery插件</a></li>
<li><a href="https://segmentfault.com/a/1190000017007631">vue项目刷新当前页面</a></li>
<li><a href="https://www.jianshu.com/p/bf862535dd30">关于css3中linear-gradient中的百分比</a></li>
<li><a href="https://www.cnblogs.com/penghuwan/p/6665140.html">webpack流行的前端模块化工具webpack初探</a></li>
<li><a href="https://blog.csdn.net/snsHL9db69ccu1aIKl9r/article/details/86610754">我经历过 Webpack 1、2、3、4 变迁后，深度拆解了Webpack</a></li>
<li><a href="https://segmentfault.com/a/1190000010349749">webpack模块化原理-commonjs</a></li>
<li><a href="https://www.cnblogs.com/RuMengkai/p/6667321.html">Gulp和Webpack对比 - 茹孟凯 - 博客园</a></li>

<li><a href="https://blog.csdn.net/w390058785/article/details/80522383">ES6 中的 for of 用法</a></li>
<li><a href="http://www.imooc.com/article/271863?block_id=tuijian_wz">JavaScript遍历器</a></li>
<li><a href="http://www.codeceo.com/article/about-javascript-traversal.html">JavaScript 中的遍历详解</a></li>
<li><a href="http://www.codeceo.com/article/javascript-traversal.html">JavaScript 各种遍历方式详解</a></li>
<li><a href="https://webpack.docschina.org/guides/dependency-management/">Webpack 管理依赖</a></li>

<li><a href="https://www.jianshu.com/p/bc6795ae0731">vue使用模拟数据接口mock.js和json-server</a></li>
<li><a href="https://www.jianshu.com/p/7094c477207d">Vue实战（三）Mock服务JSON Server</a></li>
<li><a href="https://www.cnblogs.com/steamed-twisted-roll/p/10823871.html">vue项目中使用mockjs+axios模拟后台数据返回</a></li>
<li><a href="https://blog.csdn.net/qq_40323256/article/details/101916476">Vue-cli中用mockjs axios实现前后端分离</a></li>
<li><a href="https://www.jianshu.com/p/c5568910e946">VUE项目中使用MOCK</a></li>
<li><a href="https://www.jianshu.com/p/c894ea00dfec">使用require.context实现前端工程自动化 - 简书</a></li>
<li><a href="https://blog.csdn.net/sd19871122/article/details/97391932">object对象keys(), values() entries()</a></li>
<li><a href="http://mockjs.com/examples.html">数据模板定义</a></li>
<li><a href="https://blog.csdn.net/vv_bug/article/details/84140536">前端入门之(axios解析)<sub>JavaScript</sub><sub>vv</sub><sub>bug</sub>-CSDN博客</a></li>
<li><a href="https://www.cnblogs.com/nogodie/p/9853660.html">vue中使用axios最详细教程 - 华猿 - 博客园</a></li>
<li><a href="https://segmentfault.com/a/1190000013128858">vue全局使用axios的方法 - 个人文章 - SegmentFault 思否</a></li>
<li><a href="https://www.jianshu.com/p/affdd9fa6a2a">vue中使用axios - 简书</a></li>
<li><a href="https://www.cnblogs.com/jvziking/p/11474555.html">vue中引入mock.js - Hakuna_<sub>Matata</sub> - 博客园</a></li>
<li><a href="https://www.jianshu.com/p/c5568910e946">VUE项目中使用MOCK - 简书</a></li>
<li><a href="https://www.jianshu.com/p/8bc48f8fde75">ajax和axios、fetch的区别 - 简书</a></li>
<li><a href="https://segmentfault.com/a/1190000012836882">Jquery ajax, Axios, Fetch区别之我见 - 汤姆C - SegmentFault 思否</a></li>
<li><a href="https://www.cnblogs.com/daoket/p/10205084.html">axios.js 源码分析</a></li>
<li><a href="https://cloud.tencent.com/developer/article/1483445">一步一步解析Axios源码，从入门到原理</a></li>
<li><a href="https://github.com/ronffy/axios-tutorial">axios实例应用及源码剖析 - xhr篇 （走心教程）</a></li>

<li><a href="https://cloud.tencent.com/developer/article/1618451">源码速读！一看就会、一写就废的 Promise 实现</a></li>
<li><a href="https://www.jianshu.com/p/43de678e918a">Promise实现原理（附源码）</a></li>
<li><a href="https://blog.csdn.net/java_faep/article/details/78082802">服务器端Session和客户端Session（和Cookie区别）</a></li>
<li><a href="https://blog.csdn.net/JEFF_luyiduan/article/details/88890962">Axios（自定义配置新建一个 axios 实例并且封装起来）</a></li>
<li><a href="https://jwt.io/introduction/">Introduction to JSON Web Tokens</a></li>
<li><a href="https://blog.csdn.net/weixin_42873937/article/details/82460997">使用JWT实现单点登录（完全跨域方案）</a></li>
<li><a href="https://www.cnblogs.com/cjsblog/p/9277677.html">认识 JWT</a></li>
<li><a href="https://www.cnblogs.com/xuxinstyle/p/9675541.html">深入理解 Token</a></li>
<li><a href="https://blog.csdn.net/GeniusXYT/article/details/100106204">从购买域名到nginx,flask搭建自己的网站</a></li>
<li><a href="https://www.oschina.net/translate/serving-flask-with-nginx-on-ubuntu">在 Ubuntu 上使用 Nginx 部署 Flask 应用</a></li>
<li><a href="https://www.jianshu.com/p/aed6b5204225">通过Nginx部署flask项目和静态站点</a></li>
<li><a href="https://segmentfault.com/a/1190000012918535?utm_source=tag-newest">基于Linux环境搭建Nginx+uWSGI+Python框架方法介绍</a></li>
<li><a href="https://www.cnblogs.com/chenhuabin/p/10118199.html">Python中 <code>if __name__=='__main__':</code> 理解与总结</a></li>
<li><a href="https://www.jianshu.com/p/197bb7e9f7ca">微信小程序webview问题集锦</a></li>
<li><a href="https://github.com/ronffy/axios-tutorial">axios实例应用及源码剖析 - xhr篇 （走心教程）</a></li>
<li><a href="https://blog.csdn.net/qq_36042938/article/details/91981643">Vue 中如何定义全局的工具类</a></li>
<li><a href="https://www.cnblogs.com/lvdabao/p/es6-promise-1.html">大白话讲解Promise（一） - 吕大豹 - 博客园</a></li>
<li><a href="https://cloud.tencent.com/document/product/400/4143#2.-nginx-.E8.AF.81.E4.B9.A6.E9.83.A8.E7.BD.B2">SSL 证书 证书安装指引 - 操作指南 - 文档平台 - 腾讯云</a></li>
<li><a href="https://www.cnblogs.com/xiekeli/p/5607107.html">基于Token的WEB后台认证机制 - 红心李 - 博客园</a></li>
<li><a href="https://blog.csdn.net/haochangdi123/article/details/80274210">vue-cli详解 - 小毛驴的博客 - CSDN博客</a></li>
<li><a href="https://www.cnblogs.com/xuxinstyle/p/9675541.html">深入理解token - 后知、后觉 - 博客园</a></li>
<li><a href="https://www.jianshu.com/p/20e46dc1e9d1">浏览器滚动事件 - 简书</a></li>
<li><a href="https://blog.csdn.net/u010404725/article/details/96508959">html遮罩实现 - 机智的豪哥专栏 - CSDN博客</a></li>
<li><a href="http://lmbj.net/blog/static-site-search/">静态博客之站内搜索 · 老默笔记</a></li>
<li><a href="https://www.jianshu.com/p/c7014c4bf272">网站分享插件 - 简书</a></li>
<li><a href="https://www.cnblogs.com/boyuguoblog/p/7655066.html">用jquery实现楼层滚动对应导航高亮 - ＊小七儿＊ - 博客园</a></li>
<li><a href="https://www.cnblogs.com/qdhxhz/p/8910174.html">nginx入门教程 - 雨点的名字 - 博客园</a></li>
<li><a href="https://www.jianshu.com/p/b6a9ac892577">Web Storage API - 简书</a></li>
<li><a href="https://www.w3cschool.cn/nginx/">Nginx 入门指南<sub>w3cschool</sub></a></li>
<li><a href="https://www.jb51.net/css/672226.html">使用CSS实现逼真的水波纹点击效果<sub>CSS教程</sub><sub>CSS</sub><sub>网页制作</sub><sub>脚本之家</sub></a></li>
<li><a href="http://www.sohu.com/a/305429048_661013">终于找到了一篇文章！通俗地讲解计算机工作原理<sub>操作</sub></a></li>
<li><a href="https://www.cnblogs.com/yangguoe/p/9268315.html">工厂函数 - 前端极客 - 博客园</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Prefix-Command-Arguments.html">Prefix Command Arguments - GNU Emacs Lisp Reference Manual</a></li>
<li><a href="https://blog.csdn.net/weixin_34289744/article/details/85183512">Vue CLI 3开发中屏蔽烦人的EsLint错误<sub>weixin</sub><sub>34289744的博客</sub>-CSDN博客</a></li>
<li><a href="https://www.cnblogs.com/dupd/p/7735450.html">优秀的基于VUE移动端UI框架合集 - 杜培东 - 博客园</a></li>
<li><a href="http://www.ptbird.cn/vue-draggable-dragging.html">Vue 拖拽组件 vuedraggable 和 vue-dragging - Postbird - 招猫逗狗的开发者</a></li>
<li><a href="https://blog.csdn.net/qq_32447321/article/details/79186824">让nginx上的静态网页在访问的时候没有html后缀;nginx rewrite规则</a></li>
<li><a href="https://www.cnblogs.com/leomYili/p/6346526.html?utm_source=itdadao&amp;utm_medium=referral">jsPlumb.jsAPI阅读笔记(官方文档翻译)</a></li>
<li><a href="https://docs.jsplumbtoolkit.com/toolkit/current/index.html">jsPlumb Toolkit</a></li>
<li><a href="https://www.runoob.com/jqueryui/api-draggable.html">jQuery UI API - 可拖拽小部件（Draggable Widget）</a></li>
<li><a href="http://www.imooc.com/article/255176?block_id=tuijian_wz">jQuery+jsPlumb几个响应事件整理</a></li>
<li><a href="https://blog.csdn.net/wang1006008051/article/details/78157325?depth_1-utm_source=distribute.pc_relevant.none-task&amp;utm_source=distribute.pc_relevant.none-task">html中form表单的使用方法和介绍</a></li>
<li><a href="https://www.cnblogs.com/baiyygynui/p/8463771.html">FormData 对象上传二进制文件</a></li>
<li><a href="https://www.cnblogs.com/bonly-ge/p/9259322.html">FormData的使用以及用ajax提交的注意事项</a></li>
<li><a href="https://scarletsky.github.io/2016/07/03/download-file-using-javascript/">如何用 JavaScript 下载文件</a></li>
<li><a href="https://www.2cto.com/kf/201409/333401.html">一张图轻松搞懂javascript event对象的clientX,offsetX,screenX,pageX区别</a></li>
<li><a href="http://www.uml.org.cn/zjjs/201805142.asp">详解REST架构风格</a></li>
<li><a href="https://www.jianshu.com/p/d965c80fe901">实现拖拽列表-微信小程序</a></li>
<li><a href="https://blog.csdn.net/Jason_A/article/details/86216247">H5图片上传实现（实现版）</a></li>
<li><a href="https://www.jianshu.com/p/bc29f25f305c">在 emacs 中调用外部程序</a></li>
<li><a href="https://blog.csdn.net/weixin_41646716/article/details/90069562">vue @click.native和@click.stop和@click.self</a></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-04-10 Fri 20:56</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-06-16 Tue 17:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
